Table of Contents
 Class NonConformity
Namespace
IdeaRS.OpenModel.Message
Assembly
IdeaRS.OpenModel.dll
Non-conformity
public class NonConformity
Inheritance
object
NonConformity
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 NonConformity()
Constructor
public NonConformity()
Properties
 Guid
Description of the nonconformity
public Guid Guid { get; set; }
Property Value
Guid
 Severity
severity of this nonconformity
public NonConformitySeverity Severity { get; set; }
Property Value
NonConformitySeverity
 Edit this page